# Udacity Data Scienctist Nano Degree Project 1

jupyter notebook --NotebookApp.iopub_data_rate_limit=1.0e10

## TOC: <a class="anchor" id="toc"></a>
* [Project Overview](#overview-bullet)
* [Dataset](#dataset-bullet)
* [Questions](#questions-bullet)
* [Imports](#imports-bullet)
* [Common Functions](#common-bullet)
* [Load Data](#load-bullet)
* [Understand Data](#understand-bullet)

## Project Overview <a class="anchor" id="overview-bullet"></a>
For [Udacity Data Scientist Nano Degree](https://www.udacity.com/course/data-scientist-nanodegree--nd025) project 1 you pick a dataset and using your dataset you choose 3 questions you aspire to answer from the data.

## Dataset <a class="anchor" id="dataset-bullet"></a>   
[TOC](#toc)   

Dataset from the 'Power Laws: Detecting Anomalies in Usage' competition on [drivendata.org](https://www.drivendata.org/competitions/52/anomaly-detection-electricity/page/102/).   

Commercial buildings waste an estimated 15% to 30% of energy used due to poorly maintained, degraded, and improperly controlled equipment.  The goal is to detect abnormal energy consumption, find potential energy saving opportunities and provide actionable recommendations.  

The dataset includes energy consumption data, information about the buildings, historical weather data and public holiday information.

## Questions  <a class="anchor" id="questions-bullet"></a>   
[TOC](#toc)   

Needs more refinement.  Just a rough list at this point.  
- How much much energy is being wasted?
- What's the environmental impact?
- What's the financial impact?
- What buildings are prone to wasting engergy?
- Is there a time of day more prone to wasting energy?
- Is there a season/time of year more prone to wasting energy?
- How easy/hard/costly is it to fix energy wasting?

Possible outline:  
- How much energy is being wasted and the impact
- What attributes most to wasting engergy (building, time of day, time of year)
- Recommendations to fix

## Imports  <a class="anchor" id="imports-bullet"></a>

In [1]:
import pandas as pd

## Common functions  <a class="anchor" id="common-bullet"></a>   
[TOC](#toc)

In [2]:
def unique_values_info(df):
    number_unique_vals = []
    percent_unique_vals = []
    for col_name in df.columns.tolist():
        number_unique_vals.append(len(df[col_name].unique()))
        percent_unique_vals.append(round(((len(df[col_name].unique())/df.shape[0])*100),2))
    return number_unique_vals, percent_unique_vals

In [3]:
def data_range_info(df):
    col_data_range = []
    col_data_range_count = []
    for col_name, col_dtype in zip(df.columns.tolist(), df.dtypes.tolist()):
        if col_dtype in ['int64', 'float64', 'datetime64[ns]']:
            col_data_range.append([df[col_name].min(), df[col_name].max()])
            col_data_range_count.append([])
        else:
            #col_data_range.append(df[col_name].unique().tolist())
            col_data_range.append(df[col_name].value_counts().index.tolist())
            col_data_range_count.append(df[col_name].value_counts().tolist())
    return col_data_range, col_data_range_count

In [18]:
def get_dataframe_info(df):
    info = {}
    
    num_rows = df.shape[0]
    num_cols = df.shape[1]
    num_nans = df.isnull().sum(axis=0).sum()
    
    info['name'] = df.columns.tolist()
    info['dtype'] = df.dtypes.tolist()
    nans = df.isnull().sum(axis=0).tolist()
    info['num_nans'] = nans
    pct_nans = [round((nan/df.shape[0])*100,2) for nan in nans]
    info['pct_nans'] = pct_nans
    
    col_data_range, col_data_range_count = data_range_info(df)
    info['data_range'] = col_data_range
    info['data_range_count'] = col_data_range_count
    
    col_number_unique_vals, col_percent_unique_vals = unique_values_info(df)
    info['num_unique'] = col_number_unique_vals
    info['pct_unique'] = col_percent_unique_vals
    
    df_info = pd.DataFrame(info) 
    df_info.set_index('name', inplace = True) 
        
    return num_rows, num_cols, num_nans, df_info

In [19]:
def convert_string_to_number(df, columns):
    for column in columns:
        df[column] = df[column].str.replace(r'\D+', '')
        df[column] = pd.to_numeric(df[column], errors='coerce')
    return df

## Load the data <a class="anchor" id="load-bullet"></a>

In [20]:
df_metadata = pd.read_csv('~/data/DSND-Project-1/power-laws-detecting-anomalies-in-usage-metadata.csv', sep=';')
df_holidays = pd.read_csv('~/data/DSND-Project-1/power-laws-detecting-anomalies-in-usage-holidays.csv', sep=';')
df_weather = pd.read_csv('~/data/DSND-Project-1/power-laws-detecting-anomalies-in-usage-weather.csv', sep=';')
df_energy = pd.read_csv('~/data/DSND-Project-1/train.csv', sep=',')

## Understand the data  <a class="anchor" id="understand-bullet"></a>  
[TOC](#toc)

### Metadata
____

In [21]:
df_metadata.head()

   site_id  meter_id meter_description units  surface    activity
0      038   38_9759             other   kWh      NaN      office
1      038   38_9729             other   kWh      NaN      office
2      038   38_9742             other   kWh      NaN      office
3  234_203       863        main meter    Wh   5750.0      office
4      038  38_56030           heating   kWh      NaN  laboratory

Ran get_dataframe_info() and realized site_id and meter_id need to be converted to numbers.

#### convert site_id and meter_id to numbers

In [22]:
df_metadata = convert_string_to_number(df_metadata, ['site_id', 'meter_id'])

In [23]:
df_metadata.head()

   site_id  meter_id meter_description units  surface    activity
0       38    389759             other   kWh      NaN      office
1       38    389729             other   kWh      NaN      office
2       38    389742             other   kWh      NaN      office
3   234203       863        main meter    Wh   5750.0      office
4       38   3856030           heating   kWh      NaN  laboratory

In [24]:
num_rows, num_cols, num_nans, df_metadata_info = get_dataframe_info(df_metadata)
print('number of rows:', num_rows)
print('number of columns:', num_cols)
print('number of nans:', num_nans)
display(df_metadata_info)

number of rows: 187
number of columns: 6
number of nans: 175

,dtype,num_nans,pct_nans,data_range,data_range_count,num_unique,pct_unique
name,,,,,,,
site_id,int64,0,0.00,"[38, 234203]",[],3,1.60
meter_id,int64,0,0.00,"[2, 3859804]",[],187,100.00
meter_description,object,0,0.00,"[other, temperature, lighting, heating, main m...","[92, 39, 11, 11, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2,...",25,13.37
units,object,9,4.81,"[kWh, degree celsius, Wh, count]","[113, 42, 21, 2]",5,2.67
surface,float64,166,88.77,"[2000.0, 5750.0]",[],3,1.60
activity,object,0,0.00,"[office, laboratory, general, restaurant]","[108, 34, 32, 13]",4,2.14

#### surface

In [25]:
df_metadata[df_metadata['surface'].notnull()].groupby('site_id').first()

         meter_id meter_description units  surface activity
site_id
33461           2        main meter    Wh   2000.0   office
234203        863        main meter    Wh   5750.0   office

In [26]:
df_metadata['surface'].unique()

array([  nan, 5750., 2000.])

In [27]:
df_metadata['site_id'].unique()

array([    38, 234203,  33461])

In [28]:
df_metadata.groupby(['site_id','activity']).first()

                    meter_id meter_description units  surface
site_id activity
38      general      3856727           heating   kWh      NaN
        laboratory   3856030           heating   kWh      NaN
        office        389759             other   kWh      NaN
        restaurant    389747             other   kWh      NaN
33461   office             2        main meter    Wh   2000.0
234203  office           863        main meter    Wh   5750.0

In [29]:
df_metadata.groupby(['site_id']).count()

         meter_id  meter_description  units  surface  activity
site_id
38            166                166    157        0       166
33461           2                  2      2        2         2
234203         19                 19     19       19        19

**may have to drop surface**   
Site 38 has no surface information and may have multiple buildings.

#### units

In [30]:
df_metadata[df_metadata['units'].isnull()]

     site_id  meter_id            meter_description units  surface activity
17        38    389683            RTE meter: demand   NaN      NaN  general
54        38    389684          RTE meter: reactive   NaN      NaN  general
91        38    389685           RTE meter: cos phi   NaN      NaN  general
94        38    389688  main meter: reactive energy   NaN      NaN  general
96        38    389687          main meter : demand   NaN      NaN  general
113       38    389679            RTE meter: demand   NaN      NaN  general
124       38    389681           RTE meter: cos phi   NaN      NaN  general
177       38    389689          main meter: cos phi   NaN      NaN  general
180       38    389680          RTE meter: reactive   NaN      NaN  general

In [31]:
df_metadata['units'].unique()

array(['kWh', 'Wh', 'degree celsius', nan, 'count'], dtype=object)

In [32]:
df_metadata.groupby(['units']).count()

                site_id  meter_id  meter_description  surface  activity
units
Wh                   21        21                 21       21        21
count                 2         2                  2        0         2
degree celsius       42        42                 42        0        42
kWh                 113       113                113        0       113

#### meter description

In [33]:
df_metadata['meter_description'].unique()

array(['other', 'main meter', 'heating', 'temperature', 'lighting',
       'RTE meter: demand', 'RTE meter', 'compressed air',
       'RTE meter: reactive', 'generator', 'laboratory', 'total workers',
       'RTE meter: cos phi', 'main meter: reactive energy',
       'main meter : demand', 'elevators', 'outside temperature',
       'virtual meter', 'virtual main', 'Lighting', 'cuisine',
       'cold group', 'Test Bay', 'main meter: cos phi', 'guardhouse'],
      dtype=object)

In [34]:
df_metadata.groupby(['meter_description']).count()

                             site_id  meter_id  units  surface  activity
meter_description
Lighting                           1         1      1        1         1
RTE meter                          2         2      2        0         2
RTE meter: cos phi                 2         2      0        0         2
RTE meter: demand                  2         2      0        0         2
RTE meter: reactive                2         2      0        0         2
Test Bay                           1         1      1        1         1
cold group                         2         2      2        0         2
compressed air                     2         2      2        0         2
cuisine                            2         2      2        0         2
elevators                          1         1      1        1         1
generator                          1         1      1        1         1
guardhouse                         1         1      1        0         1
heating                           11        11     11        1        11
laboratory                         2         2      2        0         2
lighting                          11        11     11        1        11
main meter                         4         4      4        3         4
main meter : demand                1         1      0        0         1
main meter: cos phi                1         1      0        0         1
main meter: reactive energy        1         1      0        0         1
other                             92        92     92       10        92
outside temperature                2         2      2        0         2
temperature                       39        39     39        0        39
total workers                      2         2      2        0         2
virtual main                       1         1      1        1         1
virtual meter                      1         1      1        1         1

### Holidays
____

In [35]:
df_holidays.head()

         Date                       Holiday site_id
0  2014-10-28                       Ohi Day  334_61
1  2010-05-24                   Whit Monday  334_61
2  2016-03-28                 Easter Monday     038
3  2012-08-15  Assumption of Mary to Heaven     038
4  2016-08-15  Assumption of Mary to Heaven  334_61

In [36]:
# convert date to datetime64
df_holidays['Date'] = pd.to_datetime(df_holidays['Date'])

In [39]:
df_holidays = convert_string_to_number(df_holidays, ['site_id'])

In [40]:
num_rows, num_cols, num_nans, df_holidays_info = get_dataframe_info(df_holidays)
print('number of rows:', num_rows)
print('number of columns:', num_cols)
print('number of nans:', num_nans)
display(df_holidays_info)

number of rows: 234
number of columns: 3
number of nans: 0

,dtype,num_nans,pct_nans,data_range,data_range_count,num_unique,pct_unique
name,,,,,,,
Date,datetime64[ns],0,0.0,"[2010-01-01 00:00:00, 2018-12-26 00:00:00]",[],180,76.92
Holiday,object,0,0.0,"[Labour Day, New year, Christmas Day, Assumpti...","[18, 18, 18, 18, 18, 18, 9, 9, 9, 9, 9, 9, 9, ...",20,8.55
site_id,int64,0,0.0,"[38, 33461]",[],2,0.85

### Weather
____

In [44]:
df_weather.head()

                   Timestamp  Temperature   Distance  site_id
0  2013-12-23T19:00:00-06:00         16.0  10.125819      NaN
1  2013-12-28T18:00:00-06:00         18.0  10.125819      NaN
2  2013-12-29T04:00:00-06:00         19.1   8.992769      NaN
3  2013-12-30T00:30:00-06:00         16.0  10.125819      NaN
4  2014-01-01T03:00:00-06:00         18.0  10.125819      NaN

In [47]:
# convert date to datetime64
df_weather['Timestamp'] = pd.to_datetime(df_weather['Timestamp'])

In [48]:
num_rows, num_cols, num_nans, df_weather_info = get_dataframe_info(df_weather)
print('number of rows:', num_rows)
print('number of columns:', num_cols)
print('number of nans:', num_nans)
display(df_weather_info)

number of rows: 391610
number of columns: 4
number of nans: 340446

,dtype,num_nans,pct_nans,data_range,data_range_count,num_unique,pct_unique
name,,,,,,,
Timestamp,object,0,0.00,"[2016-08-30 10:00:00-05:00, 2016-06-29 16:00:0...","[7, 7, 7, 7, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, ...",195176,49.84
Temperature,float64,0,0.00,"[-12.6, 45.0]",[],519,0.13
Distance,float64,0,0.00,"[8.992769136308905, 27.45594296432226]",[],8,0.00
site_id,float64,340446,86.93,"[38.0, 38.0]",[],2,0.00

In [42]:
df_weather['site_id'].unique()

array([nan, 38.])

### Energy Usage

In [49]:
df_energy.head()

   Unnamed: 0 meter_id            Timestamp  Values
0        2532        2  2015-06-11 00:00:00  2035.0
1        2543        2  2015-06-11 00:15:00  2074.0
2        2544        2  2015-06-11 00:30:00  2062.0
3        2525        2  2015-06-11 00:45:00  2025.0
4        2534        2  2015-06-11 01:00:00  2034.0

In [50]:
num_rows, num_cols, num_nans, df_energy_info = get_dataframe_info(df_energy)
print('number of rows:', num_rows)
print('number of columns:', num_cols)
print('number of nans:', num_nans)
display(df_energy_info)

number of rows: 43668606
number of columns: 4
number of nans: 16467621

,dtype,num_nans,pct_nans,data_range,data_range_count,num_unique,pct_unique
name,,,,,,,
Unnamed: 0,int64,0,0.00,"[0, 254640]",[],254641,0.58
meter_id,object,0,0.00,"[38_9733, 38_56973, 38_0, 38_9792, 38_10121, 3...","[254641, 254641, 254641, 254641, 254641, 25464...",188,0.00
Timestamp,object,0,0.00,"[2015-12-08 13:00:00, 2017-02-13 14:30:00, 201...","[186, 186, 186, 186, 186, 186, 186, 186, 186, ...",256252,0.59
Values,float64,16467621,37.71,"[-4838106.796875, 2011201032380500.0]",[],7347896,16.83